Revit 2027 API
ParameterTypeId.IfcExportPredefinedtypeType Property
 "Type IFC Predefined Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcExportPredefinedtypeType { get; }
Public Shared ReadOnly Property IfcExportPredefinedtypeType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcExportPredefinedtypeType {
	ForgeTypeId^ get ();
}
static member IfcExportPredefinedtypeType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace